OFtutorial14_SIMPLE_algorithm/testCase/Allrun
#!/bin/bash
blockMesh > log.blockMesh
ofTutorial14
