OFtutorial14_SIMPLE_algorithm/testCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3900;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4000;
        startFace       3920;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       7920;
    }
)

// ************************************************************************* //
